RIET/src/InformationRegisters/ShipmentLogs/ShipmentLogs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ShipmentLogs</name>
  <resources>
    <name>User</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Text</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>LogTo</name>
    <type>
      <types>DocumentRef.Поставка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LogType</name>
    <type>
      <types>CatalogRef.LogTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Catalogs/LogTypes/LogTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>LogTypes</name>
  <predefined>
    <items>
      <name>FS_Tracking</name>
      <description>FS tracking</description>
    </items>
    <items>
      <name>ИзменениеРеквизитов</name>
      <description>Изменение реквизитов</description>
    </items>
    <items>
      <name>ИзменениеСтатуса</name>
      <description>Изменение статуса</description>
    </items>
    <items>
      <name>ОбычныйКомментарийПользователя</name>
      <description>Обычный комментарий пользователя</description>
    </items>
  </predefined>
</mdclass:Catalog>

RIET/src/InformationRegisters/ShipmentLogs/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	// Изменине реквизитов и статусов удалять нельзя
	// То, что запись удаляет именно тот пользователь, кто ее создал, контролируется в RLS
	LogType = Элемент.ТекущиеДанные.LogType;
	Если ЗначениеЗаполнено(LogType)
		И (LogType = ПредопределенноеЗначение("Справочник.LogTypes.ИзменениеРеквизитов")
		ИЛИ LogType = ПредопределенноеЗначение("Справочник.LogTypes.ИзменениеСтатуса")) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
